app/controllers/wallpapers_controller.rb

SELECT  "wallpapers".* FROM "wallpapers" LIMIT ?  [["LIMIT", 11]]
---
  def index
    @wallpapers = Wallpaper.all

SELECT  "wallpapers".* FROM "wallpapers" WHERE "wallpapers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @wallpaper = Wallpaper.find(params[:id])

SELECT  "wallpapers".* FROM "wallpapers" WHERE "wallpapers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @wallpaper = Wallpaper.find(params[:id])

INSERT INTO "wallpapers" ("title", "category", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "air_image003"], ["category", "air"], ["image", "img_air_003.jpg"], ["created_at", "2018-10-05 13:38:12.554717"], ["updated_at", "2018-10-05 13:38:12.554717"]]
---
  def create
  	@wallpaper = Wallpaper.new(wallpaper_params)
    if @wallpaper.save

SELECT  "wallpapers".* FROM "wallpapers" WHERE "wallpapers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "wallpapers" SET "title" = ?, "category" = ?, "updated_at" = ? WHERE "wallpapers"."id" = ?  [["title", "air_image001"], ["category", "air"], ["updated_at", "2018-10-05 09:42:41.777192"], ["id", 1]]
---
  def update
  	@wallpaper = Wallpaper.find(params[:id])
    if @wallpaper.update_attributes(wallpaper_params)

SELECT  "wallpapers".* FROM "wallpapers" WHERE "wallpapers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "wallpapers" WHERE "wallpapers"."id" = ?  [["id", 1]]
---
  def destroy
    @wallpaper = Wallpaper.find(params[:id])
    @wallpaper.destroy

SELECT "wallpapers".* FROM "wallpapers"
---
  def category_mass
    categ = []
    Wallpaper.all.each { |wallpaper| categ << wallpaper.category }